app/Http/Controllers/CrudController.php

select * from `posts`
---
    public function index(Request $request)
    {
        $posts = Post::all();

select * from `posts` where `name` like '%%'
select * from `book`
---
    public function search(Request $request){
        $search = $request->get('search');
        $posts = Post::where('name','like','%'.$search.'%')
                    // orwhere('id_book','like','%'.$search.'%')
                ->get();

update `posts` set `id_book` = '2', `posts`.`updated_at` = '2019-07-29 06:30:00' where `id` = 1
---
    public function update(Request $request, $id)
    {

        $post = Post::find($id)->update($request->all());